{
  "name_en": "Alex Pevnenko",
  "intro_en": "I’m a backend developer specializing in Java and distributed systems.<br>I build reliable and scalable backend solutions with cloud technologies.<br>Passionate about clean architecture and performance optimization.",
  "about_en": "About Me",
  "projects_en": "My projects",
  "cv_en": "CV",
  "blog_en": "Blog",
  "contact_en": "Contact",
  "about_me_text_en": "I’m a backend developer specializing in Java and distributed systems. I design and build reliable, scalable services that handle real-world load and complex business logic. My main focus is performance, clean architecture, and maintainable code. I actively work with cloud technologies, microservices, and modern DevOps practices to deliver production-ready solutions. I’m also the author of the book <a href=\"https://www.chitai-gorod.ru/product/testirovanie-kontrol-i-optimizacia-koda-java-3117626\" target=\"_blank\">“Testing, Monitoring, and Performance Optimization of Java Code”</a>, where I share practical approaches to writing efficient and reliable Java applications. Beyond my core work, I enjoy 3D printing and 3D modeling, building Telegram bots in Python, and actively participating in IT conferences and hackathons. I’m always interested in challenging engineering problems where system design and thoughtful optimization truly matter.",
  "title_en": "Backend Developer",
  "introText_en": "I build reliable backend systems with Java and cloud technologies.",
  "aboutText_en": "Backend developer with a focus on performance, distributed systems and clean architecture.",
  "email_en": "alex@example.com",

  "name_ru": "Александр Певненко",
  "intro_ru": "Backend-разработчик с фокусом на Java и распределённые системы.<br>Создаю надёжные и масштабируемые backend-решения с использованием облачных технологий.<br>Люблю чистую архитектуру, оптимизацию производительности и эффективный дизайн систем.",
  "about_ru": "Обо мне",
  "projects_ru": "Мои проекты",
  "cv_ru": "Резюме",
  "blog_ru": "Блог",
  "contact_ru": "Контакты",
  "about_me_text_ru": "Я backend-разработчик, специализирующийся на Java и распределённых системах. Проектирую и разрабатываю надёжные и масштабируемые сервисы, способные работать под реальной нагрузкой и со сложной бизнес-логикой. Мой основной фокус — производительность, чистая архитектура и поддерживаемый код. Я активно работаю с облачными технологиями, микросервисами и современными DevOps-подходами, создавая решения, готовые к продакшену. Я также являюсь автором книги <a href=\"https://www.chitai-gorod.ru/product/testirovanie-kontrol-i-optimizacia-koda-java-3117626\" target=\"_blank\">«Тестирование, контроль и оптимизация кода Java»</a>, где делюсь практическими подходами к созданию эффективных и надёжных Java-приложений. Помимо основной работы, увлекаюсь 3D-печатью и 3D-моделированием, разработкой Telegram-ботов на Python, а также активно участвую в ИТ-конференциях и хакатонах. Мне особенно интересны сложные инженерные задачи, где важны продуманная архитектура, оптимизация и глубокое понимание систем.",
  "title_ru": "Backend Developer",
  "introText_ru": "Создаю надёжные backend-системы на Java с использованием облачных технологий.",
  "aboutText_ru": "Backend-разработчик с фокусом на производительность, распределённые системы и чистую архитектуру.",
  "email_ru": "alex@example.com",


  "cv_text_en":"",
  "cv_text_ru":"Я — опытный backend-разработчик с акцентом на производительность и масштабируемость Java-приложений.<br>Более 6 лет работаю с микросервисной архитектурой, Kubernetes, Kafka и высоконагруженными системами.<br>Мне нравится оптимизировать код и инфраструктуру так, чтобы приложения работали быстрее и надёжнее.<br> В свободное время увлекаюсь 3D-печатью и 3D-моделированием, пишу книги и статьи на Habr.",


  "contact_name_en":"name",
  "contact_email_en":"email",
  "contact_message_en":"message",
  "sendButton_en": "Send Message",

  "contact_name_ru":"ФИО",
  "contact_email_ru":"Почта",
  "contact_message_ru":"Сообщение",
  "sendButton_ru": "Отправить сообщение"
}
